labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  #include "stm32l1xx.h"
#include "Settings.h"

#ifdef LIB_HC05_H


#if (_USE_BT == 1)

#include "Pinouts.h"
#include "Shortcodes.h"
#include "Variables.h"
#include "Functions.h"
#include "Conversions.h"


#include "HC05_SHORTCODES.h"
#include "HAL_HC05.h"
#include "LIB_HC05.h"

HAL_HC05 hc05;

/****************************************************************
*FUNCTION NAME:test
*FUNCTION     :test codes
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::test(void)
{
  char      *strStart,*str1;
  setAtMode();
  
  hc05.sendAtCommand("AT+VERSION?\r\n", 200, 0);
  
  // Read & Update Operation
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

  str1 = strstr(strStart,"+VERSION:");
  
  if(str1!=NULL)
    sscanf(str1,"+VERSION:%s",Sim80x.IMEI);    

  debugTerminal("HC05_getVersion");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
                     
}

/****************************************************************
*FUNCTION NAME:PoweronReset
*FUNCTION     :Switch reset //details refer datasheet of CC1101/CC1100//
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::PoweronReset(void)
{
    hc05.hardReset(); 
}

/****************************************************************
*FUNCTION NAME:RegConfigSettings
*FUNCTION     :HC05 register config //details refer datasheet of ST7586S//
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::regConfigSettings(void)
{
  setAtMode();
  setFactoryDefault(200);
}

/****************************************************************
*FUNCTION NAME:setATMode
*FUNCTION     :set device to respond to AT Command Mode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
 void LIB_HC05::setAtMode(void)
 { 
   GPIO_ResetBits(HC05_GPIO_EN, HC05_PIN_EN);      //  EN pulled to LOW
   delay_ms(100);
   GPIO_SetBits(HC05_GPIO_KEY, HC05_PIN_KEY);      //  KEY PIN HIGH TO ON COMMAND AT MODE
    
   delay_ms(300);
    
   GPIO_SetBits(HC05_GPIO_EN, HC05_PIN_EN);       // EN floating to HIGH
   delay_ms(1000);   
 }

 /****************************************************************
*FUNCTION NAME:setDataMode
*FUNCTION     :set device to respond to Data Mode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::setDataMode(void)
{
  GPIO_ResetBits(HC05_GPIO_EN, HC05_PIN_EN);      //  POWER OFF
  delay_ms(100);
  GPIO_ResetBits(HC05_GPIO_KEY, HC05_PIN_KEY);    //  KEY PIN LOW TO ON DATA MODE

  delay_ms(300);

  GPIO_SetBits(HC05_GPIO_EN, HC05_PIN_EN);         //POWER ON
  delay_ms(1000);   

}

/****************************************************************
*FUNCTION NAME:debugTerminal
*FUNCTION     :Prints response to terminal IO
*INPUT        :message
*OUTPUT       :void
****************************************************************/
void LIB_HC05::debugTerminal(char *msg)
{
  #if (_SIM80X_DEBUG== 1 || _SIM80X_DEBUG==2)
     char      *strStart,*str1;

     strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      str1 = strstr(strStart,"\r\nOK\r\n");

      if(str1!=NULL)
      {
        #if (_SIM80X_DEBUG==2)
          printf("\r\nAT Respone : %s",Sim80x.UsartRxBuffer);
        #endif
        printf("\r\n%s ---> OK\r\n", msg);
      }
      else
        printf("\r\n% ---> FAILED\r\n", msg);

  #endif
}

/****************************************************************
*FUNCTION NAME:Init
*FUNCTION     :HC05 initialization
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_HC05::Init(void)
{
  hc05.gpioInit();
  hc05.uartInit(HC05_BAUDRATE_AT);
  PoweronReset();

  RegConfigSettings();
}

/****************************************************************
*FUNCTION NAME:softReset
*FUNCTION     :Reset on command
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::softReset(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(reset_cmd, "RESET");
  return (hc05.simpleCommand(AT_RESET, 0, timeout));
}

/****************************************************************
*FUNCTION NAME:probe
*FUNCTION     :probe
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::probe(unsigned long timeout)
{
  startOperation(timeout);
  hc05.writeCommand(0);
  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setFactoryDefault
*FUNCTION     :set to factory settings// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setFactoryDefault(unsigned long timeout)
{
  return hc05.sendAtCommand("AT+ORGL\r\n", 200, 0);
}

/****************************************************************
*FUNCTION NAME:getVersion
*FUNCTION     :HC05 version number // check with bharath
*INPUT        :buffer , buffer_size , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getVersion(char *buffer, size_t buffer_size, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer || buffer_size <= 1)
    return false;

  //PGM_STRING_MAPPED_TO_RAM(command, "VERSION?");
  hc05.writeCommand(AT_CMD_GET_VERSION);

  /* Response should look like "+VERSION:2.0-20100601" */
  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+VERSION:");
  
  const char *version = hc05.readResponseWithPrefix(
     response, sizeof(response), AT_RESP_VERSION);
 
  if (m_errCode != HC05_OK)
    return false;

  if (!version)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  snprintf(buffer, buffer_size, "%s", version);
  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:getAddress
*FUNCTION     :getAddress// check with bharath
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getAddress(BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "ADDR");
  return hc05.readAddressWithCommand(address, AT_ADDR, timeout);
}

/****************************************************************
*FUNCTION NAME:getName
*FUNCTION     :get Name from external device// check with bharath
*INPUT        :buffer , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getName(char *buffer, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer)
  {
    m_errCode = HC05_FAIL;
    return false;
  }

