labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  //PGM_STRING_MAPPED_TO_RAM(command, "NAME?");
  hc05.writeCommand(AT_CMD_GET_NAME);

  char response[40];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+NAME:");
  
  char *name_part = hc05.readResponseWithPrefix(response, sizeof(response), AT_RESP_NAME);

  if (m_errCode != HC05_OK)
    return false;

  if (!name_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  
  snprintf(buffer, HC05_NAME_BUFSIZE, "%s", name_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setName
*FUNCTION     :set Name to extenal device// check with bharath
*INPUT        :name , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setName(const char *name, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "NAME=");
  return(hc05.simpleCommand(AT_CMD_SET_NAME, name, timeout));
}

/****************************************************************
*FUNCTION NAME:getRemoteDeviceName
*FUNCTION     :get Remote Device Name // check with bharath
*INPUT        :address : BluetoothAddress , buffer , buffer_size , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getRemoteDeviceName(const BluetoothAddress &address,
  char *buffer, size_t buffer_size, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer || !buffer_size)
  {
    m_errCode = HC05_FAIL;
    return false;
  }

  char address_str[HC05_ADDRESS_BUFSIZE];
  hc05.printBluetoothAddress(address_str, address, ',');
  
  //PGM_STRING_MAPPED_TO_RAM(command, "RNAME?");
  
  hc05.writeCommand(AT_CMD_GET_RNAME, address_str);

  char response[40];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+RNAME:");
  char *name_part = hc05.readResponseWithPrefix(response, sizeof(response), AT_RESP_RNAME);

  if (m_errCode != HC05_OK)
    return false;

  if (!name_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  snprintf(buffer, buffer_size, "%s", name_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:getRole
*FUNCTION     :getRole// check with bharath
*INPUT        :role:  HC05 role , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getRole(HC05_Role &role, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "ROLE?");
  hc05.writeCommand(AT_CMD_GET_ROLE);

  char response[20];
 // PGM_STRING_MAPPED_TO_RAM(response_pattern, "+ROLE:");
  const char *role_str = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_ROLE);

  if (m_errCode != HC05_OK)
    return false;

  if (!role_str)
    return hc05.readOperationResult() && false;

  role = static_cast<HC05_Role>(atol(role_str));

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setRole
*FUNCTION     :setRole// check with bharath
*INPUT        :role:  HC05 role , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setRole(HC05_Role role, unsigned long timeout)
{
  char role_str[10] = { role, 0 };
 // PGM_STRING_MAPPED_TO_RAM(format, "%d");
  snprintf(role_str, sizeof(role_str), "%d", role);

  //PGM_STRING_MAPPED_TO_RAM(command, "ROLE=");
  return hc05.simpleCommand(AT_CMD_SET_ROLE, role_str, timeout);
}

/****************************************************************
*FUNCTION NAME:getDeviceClass
*FUNCTION     :get Device Class // check with bharath
*INPUT        :device_class , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getDeviceClass(uint32_t &device_class, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "CLASS?");
  hc05.writeCommand(AT_CMD_GET_CLASS);

  device_class = 0;

  char response[40];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+CLASS:");
  const char *class_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_CLASS);

  if (m_errCode != HC05_OK)
    return false;

  if (!class_part)
    return hc05.readOperationResult() && false;

  device_class = htoul(class_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setDeviceClass
*FUNCTION     :set Device Class// check with bharath
*INPUT        :device_class , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setDeviceClass(uint32_t device_class, unsigned long timeout)
{
  char class_str[10];
  //PGM_STRING_MAPPED_TO_RAM(format, "%lx");
  snprintf(class_str, sizeof(class_str), "%lx", device_class);

 // PGM_STRING_MAPPED_TO_RAM(command, "CLASS=");
  return hc05.simpleCommand(AT_CMD_SET_CLASS, class_str, timeout);
}

/****************************************************************
*FUNCTION NAME:getInquiryAccessCode
*FUNCTION     :getInquiryAccessCode// check with bharath
*INPUT        :iac , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getInquiryAccessCode(uint32_t &iac, unsigned long timeout)
{
  startOperation(timeout);

 // PGM_STRING_MAPPED_TO_RAM(command, "IAC?");
  hc05.writeCommand(AT_CMD_GET_IAC);

  iac = 0;

  if (isOperationTimedOut())
    return false;

  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+IAC:");
  const char *iac_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_IAC);

  if (m_errCode != HC05_OK)
    return false;

