labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  if (!iac_part)
    return hc05.readOperationResult() && false;

  iac = htoul(iac_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setInquiryAccessCode
*FUNCTION     :setInquiryAccessCode// check with bharath
*INPUT        :iac , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setInquiryAccessCode(uint32_t iac, unsigned long timeout)
{
  char iac_str[10];
  //PGM_STRING_MAPPED_TO_RAM(format, "%lx");
  snprintf(iac_str, sizeof(iac_str), "%lx", iac);

  //PGM_STRING_MAPPED_TO_RAM(command, "IAC=");
  return hc05.simpleCommand(AT_CMD_SET_IAC, iac_str, timeout);
}

/****************************************************************
*FUNCTION NAME:getInquiryMode
*FUNCTION     :getInquiryMode// check with bharath
*INPUT        :inq_mode , max_devices , max_duration , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getInquiryMode(HC05_InquiryMode &inq_mode,
  int16_t &max_devices, uint8_t &max_duration, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "INQM?");
  hc05.writeCommand(AT_CMD_GET_INQM);

  inq_mode = HC05_INQUIRY_STANDARD;
  max_devices = 0;
  max_duration = 0;

  char response[30];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+INQM:");
  char *mode_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_INQM);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_part)
    return hc05.readOperationResult() && false;

  inq_mode = static_cast<HC05_InquiryMode>(atol(mode_part));
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_devices = atol(++mode_part);
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_duration = atol(++mode_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setInquiryMode
*FUNCTION     :setInquiryMode// check with bharath
*INPUT        :inq_mode , max_devices , max_duration , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setInquiryMode(HC05_InquiryMode inq_mode,
  int16_t max_devices, uint8_t max_duration, unsigned long timeout)
{
  char mode[20];
  
  /* Yeah, max_devices is signed 16-bit integer, but the module accepts
   * an unsigned 16-bit integer while actually interpreting it as signed.
   *                          <-^->
   * Tricky chinese engineers (-_-)
   *                            "
   */
  
  //PGM_STRING_MAPPED_TO_RAM(format, "%d,%u,%u");
  snprintf(mode, sizeof(mode), "%d,%u,%u", inq_mode, (uint16_t)max_devices, max_duration);

  //PGM_STRING_MAPPED_TO_RAM(command, "INQM=");
  return hc05.simpleCommand(AT_CMD_SET_INQM, mode, timeout);
}

/****************************************************************
*FUNCTION NAME:getPassword
*FUNCTION     :getPassword// check with bharath
*INPUT        :buffer , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getPassword(char *buffer, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer)
  {
    m_errCode = HC05_FAIL;
    return false;
  }

  //PGM_STRING_MAPPED_TO_RAM(command, "PSWD?");
  hc05.writeCommand(AT_CMD_GET_PSWD);

  char response[HC05_PASSWORD_MAXLEN + 15];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+PSWD:");
  const char *password_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_PSWD);

  if (m_errCode != HC05_OK)
  {
    *buffer = 0;
    return false;
  }

  if (!password_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  snprintf(buffer, HC05_PASSWORD_BUFSIZE, "%s", password_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setPassword
*FUNCTION     :setPassword// check with bharath
*INPUT        :password , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setPassword(const char *password, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "PSWD=");
  return hc05.simpleCommand(AT_CMD_SET_PSWD, password, timeout);
}

/****************************************************************
*FUNCTION NAME:getSerialMode
*FUNCTION     :getSerialMode// check with bharath
*INPUT        :speed , stop_bits ,  parity , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getSerialMode(uint32_t &speed, uint8_t &stop_bits,
  HC05_Parity &parity, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "UART?");
  hc05.writeCommand(AT_CMD_GET_UART);

  char response[30];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+UART:");
  char *mode_str = hc05.readResponseWithPrefix(response, sizeof(response), AT_RESP_UART);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_str)
    return hc05.readOperationResult() && false;

  speed = atol(mode_str);
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  stop_bits = atol(++mode_str) + 1;
  mode_str = strchrnul(mode_str, ',');

  if (*mode_str != ',')
  {
    m_errCode = HC05_FAIL;
    return hc05.readOperationResult() && false;
  }

  parity = static_cast<HC05_Parity>(atol(++mode_str));

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setSerialMode
*FUNCTION     :setSerialMode// check with bharath
*INPUT        :speed , stop_bits ,  parity , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setSerialMode(uint32_t speed,
  uint8_t stop_bits, HC05_Parity parity, unsigned long timeout)
{
  stop_bits -= 1; // 0: 1 stop bit, 1: 2 stop bits, any other are not allowed

