labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  char mode_str[20];
  //PGM_STRING_MAPPED_TO_RAM(format, "%lu,%u,%u");
  snprintf(mode_str, sizeof(mode_str), "%lu,%u,%u", speed, stop_bits, parity);

  //PGM_STRING_MAPPED_TO_RAM(command, "UART=");
  return hc05.simpleCommand(AT_CMD_SET_UART, mode_str, timeout);
}

/****************************************************************
*FUNCTION NAME:getConnectionMode
*FUNCTION     :getConnectionMode  // check with bharath
*INPUT        :connection_mode , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getConnectionMode(
  HC05_Connection &connection_mode, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "CMODE?");
  hc05.writeCommand(AT_CMD_GET_CMODE);

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+CMOD:");
  const char *mode_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_CMODE);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_part)
    return hc05.readOperationResult() && false;

  connection_mode = static_cast<HC05_Connection>(atol(mode_part));

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setConnectionMode
*FUNCTION     :setConnectionMode// check with bharath
*INPUT        :connection_mode , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setConnectionMode(
  HC05_Connection connection_mode, unsigned long timeout)
{
  char mode_str[20];
  
  //PGM_STRING_MAPPED_TO_RAM(format, "%u");
  snprintf(mode_str, sizeof(mode_str), "%u", connection_mode);

  //PGM_STRING_MAPPED_TO_RAM(command, "CMODE=");
  return hc05.simpleCommand(AT_CMD_SET_CMODE, mode_str, timeout);
}

/****************************************************************
*FUNCTION NAME:bind
*FUNCTION     :bind// check with bharath
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::bind(const BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "BIND");
  return hc05.writeAddressWithCommand(address, AT_BIND, timeout);
}

/****************************************************************
*FUNCTION NAME:getAddressBound
*FUNCTION     :getAddressBound// check with bharath
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getAddressBound(BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "BIND");
  return hc05.readAddressWithCommand(address, AT_BIND, timeout);
}

/****************************************************************
*FUNCTION NAME:getLeds
*FUNCTION     :get Leds status// check with bharath
*INPUT        :led_status , led_connection , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getLeds(bool &led_status,
  bool &led_connection, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "POLAR?");
  hc05.writeCommand(AT_CMD_GET_POLAR);

  led_status = 0;
  led_connection = 0;

  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+POLAR:");
  
  char *status_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_POLAR);

  if (m_errCode != HC05_OK)
    return false;

  if (!status_part)
    return hc05.readOperationResult() && false;

  led_status = atol(status_part);
  status_part = strchrnul(status_part, ',');

  if (*status_part != ',')
    return hc05.readOperationResult() && false;

  led_connection = atol(++status_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setLeds
*FUNCTION     :set Leds status// check with bharath
*INPUT        :led_status , led_connection , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setLeds(bool led_status,
  bool led_connection, unsigned long timeout)
{
  char leds_str[10];
  //PGM_STRING_MAPPED_TO_RAM(format, "%d,%d");
  snprintf(leds_str, sizeof(leds_str), "%d,%d",
    (led_status ? 1 : 0), (led_connection ? 1 : 0));

  //PGM_STRING_MAPPED_TO_RAM(command, "POLAR=");
  return hc05.simpleCommand(AT_CMD_SET_POLAR, leds_str, timeout);
}

/****************************************************************
*FUNCTION NAME:setPortState
*FUNCTION     :set HC05 Ports States// check with bharath
*INPUT        :port_states , port_num , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setPortState(uint8_t port_num,
  uint8_t port_state, unsigned long timeout)
{
  char state_str[10];
  //PGM_STRING_MAPPED_TO_RAM(format, "%u,%u");
  snprintf(state_str, sizeof(state_str), "%u,%u", port_num, port_state);

  //PGM_STRING_MAPPED_TO_RAM(command, "PIO=");
  return hc05.simpleCommand(AT_CMD_SET_PIO, state_str, timeout);
}

/****************************************************************
*FUNCTION NAME:getMultiplePorts
*FUNCTION     :getMultiplePorts// check with bharath
*INPUT        :port_states , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getMultiplePorts(uint16_t &port_states, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "MPIO?");
  hc05.writeCommand(AT_CMD_GET_MPIO);

  port_states = 0;

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+MPIO:");
  const char *states_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_MPIO);

  if (m_errCode != HC05_OK)
    return false;

  if (!states_part)
    return hc05.readOperationResult() && false;

  port_states = htoul(states_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setMultiplePorts
*FUNCTION     :setMultiplePorts  // check with bharath
*INPUT        :port_states , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setMultiplePorts(uint16_t port_states, unsigned long timeout)
{
  char states_str[10];
  //PGM_STRING_MAPPED_TO_RAM(format, "%x");
  snprintf(states_str, sizeof(states_str), "%x", port_states);

  //PGM_STRING_MAPPED_TO_RAM(command, "MPIO=");
  return hc05.simpleCommand(AT_CMD_SET_MPIO, states_str, timeout);
}

/****************************************************************
*FUNCTION NAME:getInquiryAndPagingParams
*FUNCTION     :getInquiryAndPagingParams// check with bharath
*INPUT        :inquiry_interval , inquiry_duration , paging_interval , paging_duration , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getInquiryAndPagingParams(
  uint16_t &inquiry_interval, uint16_t &inquiry_duration,
  uint16_t &paging_interval, uint16_t &paging_duration, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "IPSCAN?");
  hc05.writeCommand(AT_CMD_GET_IPSCAN);

  char response[40];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+IPSCAN:");
  
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_IPSCAN);

  if (m_errCode != HC05_OK)
    return false;

