labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  if (!params_part)
    return hc05.readOperationResult() && false;

  inquiry_interval = atol(params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  inquiry_duration = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  paging_interval = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  paging_duration = atol(++params_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setInquiryAndPagingParams
*FUNCTION     :setInquiryAndPagingParams// check with bharath
*INPUT        :inquiry_interval , inquiry_duration , paging_interval , paging_duration , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setInquiryAndPagingParams(
  uint16_t inquiry_interval, uint16_t inquiry_duration,
  uint16_t paging_interval, uint16_t paging_duration, unsigned long timeout)
{
  char params_str[40];
  
  //PGM_STRING_MAPPED_TO_RAM(format, "%u,%u,%u,%u");
  snprintf(params_str, sizeof(params_str), "%u,%u,%u,%u",
    inquiry_interval, inquiry_duration, paging_interval, paging_duration);

  //PGM_STRING_MAPPED_TO_RAM(command, "IPSCAN=");
  return hc05.simpleCommand(AT_CMD_SET_IPSCAN, params_str, timeout);
}

/****************************************************************
*FUNCTION NAME:getSniffParams
*FUNCTION     :getSniffParams// check with bharath
*INPUT        :max_time , min_time , retry_interval , sniff_timeout , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getSniffParams(uint16_t &max_time, uint16_t &min_time,
  uint16_t &retry_interval, uint16_t &sniff_timeout, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "SNIFF?");
  hc05.writeCommand(AT_CMD_GET_SNIFF);

  char response[40];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+SNIFF:");
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_SNIFF);

  if (m_errCode != HC05_OK)
    return false;

  if (!params_part)
    return hc05.readOperationResult() && false;

  max_time = atol(params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  min_time = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  retry_interval = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  sniff_timeout = atol(++params_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setSniffParams
*FUNCTION     :set Sniff Parameter// check with bharath
*INPUT        :max_time , min_time , retry_interval , sniff_timeout , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setSniffParams(uint16_t max_time, uint16_t min_time,
  uint16_t retry_interval, uint16_t sniff_timeout, unsigned long timeout)
{
  char params_str[40];
  //PGM_STRING_MAPPED_TO_RAM(format, "%u,%u,%u,%u");
  snprintf(params_str, sizeof(params_str), "%u,%u,%u,%u",
    max_time, min_time, retry_interval, sniff_timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "SNIFF=");
  return hc05.simpleCommand(AT_CMD_SET_SNIFF, params_str, timeout);
}

/****************************************************************
*FUNCTION NAME:enterSniffMode
*FUNCTION     :enterSniffMode// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::enterSniffMode(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "ENSNIFF");
  return hc05.simpleCommand(AT_CMD_ENSNIFF, 0, timeout);
}

/****************************************************************
*FUNCTION NAME:exitSniffMode
*FUNCTION     :exitSniffMode// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::exitSniffMode(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "EXSNIFF");
  return hc05.simpleCommand(AT_CMD_EXSNIFF, 0, timeout);
}

/****************************************************************
*FUNCTION NAME:getSecurityAndEncryption
*FUNCTION     :getSecurityAndEncryption // check with bharath
*INPUT        :Security,encryption , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getSecurityAndEncryption(HC05_Security &security,
  HC05_Encryption &encryption, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "SENM?");
  hc05.writeCommand(AT_CMD_GET_SENM);

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+SENM:");
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_SENM);

  if (m_errCode != HC05_OK)
    return false;

  if (!params_part)
    return hc05.readOperationResult() && false;

  security = static_cast<HC05_Security>(atol(params_part));
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  encryption = static_cast<HC05_Encryption>(atol(++params_part));

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:setSecurityAndEncryption
*FUNCTION     :setSecurityAndEncryption// check with bharath
*INPUT        :security , encryption , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setSecurityAndEncryption(HC05_Security security,
  HC05_Encryption encryption, unsigned long timeout)
{
  char params_str[10];
  //PGM_STRING_MAPPED_TO_RAM(format, "%u,%u");
  snprintf(params_str, sizeof(params_str), "%u,%u", security, encryption);

  //PGM_STRING_MAPPED_TO_RAM(command, "SENM=");
  return hc05.simpleCommand(AT_CMD_SET_SENM, params_str, timeout);
}


/****************************************************************
*FUNCTION NAME:deleteDeviceFromList
*FUNCTION     :deleteDeviceFromList// check with bharath
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::deleteDeviceFromList(
    const BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "RMSAD");
  return hc05.writeAddressWithCommand(address, AT_RMSAD, timeout);
}

/****************************************************************
*FUNCTION NAME:deleteAllDevicesFromList
*FUNCTION     :deleteAllDevicesFromList// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::deleteAllDevicesFromList(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "RMAAD");
  return hc05.simpleCommand(AT_RMAAD, 0, timeout);
}

/****************************************************************
*FUNCTION NAME:findDeviceInList
*FUNCTION     :findDeviceInList // check with bharath
*INPUT        :address : Bluetoothaddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::findDeviceInList(
  const BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "FSAD");
  return hc05.writeAddressWithCommand(address, AT_FSAD, timeout);
}

/****************************************************************
*FUNCTION NAME:countDevicesInList
*FUNCTION     :countDevicesInList  // check with bharath
*INPUT        :device_count , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::countDevicesInList(uint8_t &device_count, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "ADCN?");
  hc05.writeCommand(AT_CMD_GET_ADCN);

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+ADCN:");
  const char *count_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_ADCN);

  if (m_errCode != HC05_OK)
    return false;

  if (!count_part)
    return hc05.readOperationResult() && false;

  device_count = atol(count_part);

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:getLastAuthenticatedDevice
*FUNCTION     :getLastAuthenticatedDevice  // check with bharath
*INPUT        :address : BluetoothAddress , timeout;
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getLastAuthenticatedDevice(
  BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "MRAD");
  return hc05.readAddressWithCommand(address, AT_MRAD, timeout);
}

/****************************************************************
*FUNCTION NAME:getState
*FUNCTION     :getState// check with bharath
*INPUT        :state , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getState(HC05_State &state, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "STATE?");
  hc05.writeCommand(AT_CMD_GET_STATE);

  state = HC05_UNKNOWN;

  char response[40];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+STATE:");
  const char *status_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_STATE);

  if (m_errCode != HC05_OK)
    return false;

  if (!status_part)
    return hc05.readOperationResult() && false;

  //PGM_STRING_MAPPED_TO_RAM(INITIALIZED, "INITIALIZED");
  //PGM_STRING_MAPPED_TO_RAM(READY, "READY");
  //PGM_STRING_MAPPED_TO_RAM(PAIRABLE, "PAIRABLE");
  //PGM_STRING_MAPPED_TO_RAM(PAIRED, "PAIRED");
  //PGM_STRING_MAPPED_TO_RAM(INQUIRING, "INQUIRING");
  //PGM_STRING_MAPPED_TO_RAM(CONNECTING, "CONNECTING");
  //PGM_STRING_MAPPED_TO_RAM(CONNECTED, "CONNECTED");
  //PGM_STRING_MAPPED_TO_RAM(DISCONNECTED, "DISCONNECTED");
  //PGM_STRING_MAPPED_TO_RAM(UNKNOWN, "UNKNOWN");

  if (strcmp(status_part, AT_INITIALIZED) == 0)
    state = HC05_INITIALIZED;
  else if (strcmp(status_part, AT_READY) == 0)
    state = HC05_READY;
  else if (strcmp(status_part, AT_PAIRABLE) == 0)
    state = HC05_PAIRABLE;
  else if (strcmp(status_part, AT_PAIRED) == 0)
    state = HC05_PAIRED;
  else if (strcmp(status_part, AT_INQUIRING) == 0)
    state = HC05_INQUIRING;
  else if (strcmp(status_part, AT_CONNECTING) == 0)
    state = HC05_CONNECTING;
  else if (strcmp(status_part, AT_CONNECTED) == 0)
    state = HC05_CONNECTED;
  else if (strcmp(status_part, AT_DISCONNECTED) == 0)
    state = HC05_DISCONNECTED;
  else if (strcmp(status_part, AT_UNKNOWN) == 0)
    state = HC05_UNKNOWN;

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:initSerialPortProfile
*FUNCTION     :initSerialPortProfile  // check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::initSerialPortProfile(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "INIT");
  return hc05.simpleCommand(AT_INIT, 0, timeout);
}

/****************************************************************
*FUNCTION NAME:inquire
*FUNCTION     :inquire// check with bharath
*INPUT        :callback , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::inquire(InquiryCallback callback, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "INQ");
  hc05.writeCommand(AT_INQ);

  while (!isOperationTimedOut())
  {
    //if (m_uart->peek() != '+')
    if(USART_ReceiveData(HC05_USART_CH) != '+')
      break;

    char response[HC05_ADDRESS_BUFSIZE + 10];
    
    //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+INQ:");
    const char *address_part;
    address_part = hc05.readResponseWithPrefix(response, sizeof(response), AT_RESP_INQ);

    BluetoothAddress address;
    hc05.parseBluetoothAddress(address, address_part, ':');

    if (callback)
      callback(address);
  }

  return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:cancelInquiry
*FUNCTION     :cancelInquiry  // check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::cancelInquiry(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "INQC");
  return hc05.simpleCommand(AT_INQC, 0, timeout);
}

/****************************************************************
*FUNCTION NAME:pair
*FUNCTION     :pairing AT commands  // check with bharath
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::pair(const BluetoothAddress &address, unsigned long timeout)
{
  char params_str[HC05_ADDRESS_BUFSIZE + 15];
  int address_length = hc05.printBluetoothAddress(params_str, address, ',');

  //PGM_STRING_MAPPED_TO_RAM(format, ",%lu");
  snprintf(params_str + address_length,
    sizeof(params_str) - address_length, ",%lu", timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "PAIR");
  return hc05.simpleCommand(AT_PAIR, params_str, timeout);
}

/****************************************************************
*FUNCTION NAME:connect
*FUNCTION     :connect  // check with bharath
*INPUT        :address : BluetoothAddress , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::connect(const BluetoothAddress &address, unsigned long timeout)
{
  return hc05.writeAddressWithCommand(address, "LINK", timeout);
}

/****************************************************************
*FUNCTION NAME:disconnect
*FUNCTION     :disconnect commands// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::disconnect(unsigned long timeout)
{
  startOperation(timeout);
  hc05.writeCommand(AT_DISC);

  //PGM_STRING_MAPPED_TO_RAM(SUCCESS, "SUCCESS");
  //PGM_STRING_MAPPED_TO_RAM(LINK_LOSS, "LINK_LOSS");
  //PGM_STRING_MAPPED_TO_RAM(NO_SLC, "NO_SLC");
 // PGM_STRING_MAPPED_TO_RAM(TIMEOUT, "TIMEOUT");
  //PGM_STRING_MAPPED_TO_RAM(ERROR, "ERROR");

  char response[20];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, AT_RESP_DISC);
  
