labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  const char *status_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_DISC);

  if (strcmp(status_part, AT_SUCCESS) == 0)
    m_errCode = HC05_OK;
  else if (strcmp(status_part, AT_LINK_LOSS) == 0)
    m_errCode = HC05_ERR_DISC_LINK_LOSS;
  else if (strcmp(status_part, AT_NO_SLC) == 0)
    m_errCode = HC05_ERR_DISC_NO_SLC;
  else if (strcmp(status_part, AT_TIMEOUT) == 0)
    m_errCode = HC05_ERR_DISC_TIMEOUT;
  else if (strcmp(status_part, AT_ERROR) == 0)
    m_errCode = HC05_ERR_DISC_ERROR;

   return hc05.readOperationResult();
}

/****************************************************************
*FUNCTION NAME:sendData
*FUNCTION     :send hex Data 
*INPUT        :message
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::sendData(byte *msg)
{
  hc05.writeString(msg);
  
  return 1;
}

// /****************************************************************
// *FUNCTION NAME:getData
// *FUNCTION     :getData 
// *INPUT        :timeout
// *OUTPUT       :bool
// ****************************************************************/
// bool LIB_HC05::getData(byte *buffer, size_t buffer_size)
// {
//   uint16_t index = 0;
//   if (!buffer || buffer_size <= 1)
//     return 0;

//   char *p = buffer;
//   *p = 0;
  
//   while(index < buffer_size)
//   {
//     *p = hc05.getc();
//     p++;
//     index++;  
//     if(p[-1] == '\n' )
//     { 
//       p -= 1;       // setting '/n' as null char
//       *p = 0;
      
//       p -= 1;       // setting '/r' as null char
//       *p = 0;
      
//        goto EXIT_LOOP;
//     }
//   }
  
//   EXIT_LOOP:
    
//   return 1;
// }

extern LIB_HC05 bl; 

#endif

#endif